VA_NAME = 'Danya the VA'

VA_VER = '2.0'

VA_ALIAS = ('да не', 'далее')

VA_TBR = ()

VA_CMDS = {
    'hi': ('привет', 'здарова', 'ку'),
    'bye': ('пока', 'прощай', 'до свидания', 'до следующей поездки', 'до встречи'),
    'dela': ('как дела', 'как твои дела', 'как прошёл твой день', 'как настроение'),
    'thanks': ('спасибо', 'благодарю'),
    'current_time': ('время', 'текущее время', 'сейчас времени', 'который час', 'сколько времени'),
    'joke': ('расскажи шутку', 'расскажи анекдот', 'шутка', 'анекдот', 'скажи шутку', 'скажи анекдот')
}

VA_CMD_RESPONSES = {

}

JOKES = (
    'Сын сказал, что когда вырастет, у него будет\nнесколько профессий: клоун, фокусник и программист.\nОн ещё не знает, что в IT это одна профессия.',
    'Чем программист-экстроверт отличается от\nпрограммиста-интроверта? Экстроверт во время собеседования\nсмотрит на твои шнурки, а интроверт - на свои',
    'Молодой хакер спрашивает у более опытного -\nскажи, а как ты зарабатываешь в интернете? Ну тот такой\nпомялся и говорит - перечисли мне на счет\n100 рублей, скажу. Ну тот перечислил. Ну, говорит,\nскажи как. - Ну как как, говорит, вот так и зарабатываю.',
    'Попроси программиста проверить десять строк\nкода, он найдёт десять проблем. Попроси его проверить\nпятьсот строк, он скажет, что выглядит норм.',
    'Программист - это единственная в мире профессия,\nгде платят деньги, чтобы ты исправил ошибки,\nкоторые допустил, когда перед этим сделал\nсвою работу херово.',
    'Бог по ошибке выпустил приложение "две тысячи\nдвадцатый год" с вирусом. Исправление две тысячи\nдвадцать первого не помогло. Как бы ему\nне пришлось переустанавливать систему?',
    'Я программист простой: если задача простая,\nто мне скучно, а если сложная — трудно и страшно,\nчто не получится сделать.',
    'Сольфеджио для программистов: интервьюер\nчитает тебе вслух код, а ты должен сказать,\nчто этот код делает.',
    'Зачем к устройству с "интуитивно-понятным\nинтерфейсом" инструкция на сто плюс страниц?',
    'Любая курица легко может программировать,\nесли на клавиатуру насыпать зерно.',
    'Когда появятся беспилотные самолеты,\nпервыми в них откажутся летать программисты.'
)

AI_CREDENTIALS = 'NmUxNDcwZTQtNjhmYS00ZWRhLThlNGItNzcwN2FkNTM0YWY5Ojk5OTI5MDU0LThhMTctNDJjNi1hZjE2LTZlODBiMTYxMTQwNQ=='
